---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructureLayer.Dispose
source: html/6d5fe33c-dce4-1a69-d27e-c5472cf8363e.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.Dispose Method

Releases all resources used by the CompoundStructureLayer

## Syntax (C#)
```csharp
public void Dispose()
```